Revit 2024 API
ControlledApplication.AllUsersAddinsLocation Property
 The folder location for .addin files for all users.
Namespace: Autodesk.Revit.ApplicationServices
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public string AllUsersAddinsLocation { get; }
Visual Basic
Public ReadOnly Property AllUsersAddinsLocation As String
	Get
Visual C++
public:
property String^ AllUsersAddinsLocation {
	String^ get ();
}
See Also
ControlledApplication Class
Autodesk.Revit.ApplicationServices Namespace